content/org-info/emacs_com/emacs_GTD.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-20 Mon 20:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GTD &amp;&amp; org-mode</title>
<meta name="generator" content="Org mode" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../emacs.html"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">GTD &amp;&amp; org-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org08ccef5">1. 为什么要用GTD</a></li>
<li><a href="#orgee40f10">2. GTD是什么</a>
<ul>
<li><a href="#orgf493d67">2.1. 人生5楼</a></li>
<li><a href="#org26e4a57">2.2. GTD是什么</a></li>
</ul>
</li>
<li><a href="#org9797d90">3. GTD怎么实现</a></li>
<li><a href="#orgfcd2db5">4. org mode怎么实现GTD</a>
<ul>
<li><a href="#org33138a8">4.1. 思路的设计</a></li>
<li><a href="#org511e486">4.2. 流程的设计</a></li>
<li><a href="#org1265f98">4.3. 文件的设计</a></li>
<li><a href="#org49653e8">4.4. <span class="todo TODO">TODO</span> 的设计</a></li>
<li><a href="#org2a7193d">4.5. TAGS的设计</a></li>
<li><a href="#orga8f6745">4.6. Agent的设计</a></li>
<li><a href="#org7fdf80c">4.7. 使用流程</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org08ccef5" class="outline-2">
<h2 id="org08ccef5"><span class="section-number-2">1</span> 为什么要用GTD</h2>
<div class="outline-text-2" id="text-1">
<p>
  每天或每周需要处理的事情非常之多, 小到晚上要洗衣服, 大到明天项目交付. 这些事情如果都存储在脑中, 轻则
焦虑不堪, 重则脑子爆炸. 而且脑中一旦塞满了这类事情, 非常不利于思考. 大脑应该是拿来思考的, 而不是用来存
储的. 假设一种情形, 大脑只用来思考, 而存储则放在大脑之外, 那么我们就不必因当下之外的事情而焦虑, 能够更
专一的处理当下的问题. 同时, 如果外在存储能够提醒我们何时该思考何问题, 那么我们也不会因错过了某事而悔恨
,比如女友生日. 而这也是GTD的目的所在, 大脑只用来思考, 存储在脑外.
</p>
</div>
</div>
<div id="outline-container-orgee40f10" class="outline-2">
<h2 id="orgee40f10"><span class="section-number-2">2</span> GTD是什么</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf493d67" class="outline-3">
<h3 id="orgf493d67"><span class="section-number-3">2.1</span> 人生5楼</h3>
<div class="outline-text-3" id="text-2-1">
<p>
了解GTD之前, 必须了解人生5楼.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">楼数</th>
<th scope="col" class="org-left">功能</th>
<th scope="col" class="org-left">说明</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">5楼</td>
<td class="org-left">人生规划</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4楼</td>
<td class="org-left">3年目标</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3楼</td>
<td class="org-left">1年目标</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2楼</td>
<td class="org-left">职责范围</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">1楼</td>
<td class="org-left">项目</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">GTD管理</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">地面</td>
<td class="org-left">行动清单</td>
<td class="org-left">归属1楼</td>
<td class="org-left">GTD管理</td>
</tr>
</tbody>
</table>

<p>
   把人生(或部分人生)比喻成一座大厦, 1楼是我们当下要做的事情, 2楼是我们的职责范围, 3楼是我们1年后的样
子, 4楼是我们3年后的样子, 5楼是我们人生(10年, 20年或一辈子)的规划.
</p>

<p>
   <span class="underline">我们的人生是高层决定了低层</span>. 比如, 如果想成为计算机专家(5楼), 那么3年后要先成为工程师(4楼), 1年后
要先成为程序员(3楼). 为了要成为程序员, 也许我们需要去报班学习(2楼职责为学习),或者成为程序员助理(2楼职
责为搬砖). 而1楼则是我们当下要确确实实需要处理的事情, 比如看书, 工作, 与同事交流等, 所有一切能对我们有
提升的事情.
</p>

<p>
<span class="underline">大厦是由低到高建造的</span>. 千里之行, 始于足下. 1楼的行为直接决定了能否达到后面的楼层.
</p>

<p>
大厦最难的地方不在于实现5楼的规划, 而在于制定5楼的规划. 不过这也正是人生的魅力所在吧.
</p>
</div>
</div>
<div id="outline-container-org26e4a57" class="outline-3">
<h3 id="org26e4a57"><span class="section-number-3">2.2</span> GTD是什么</h3>
<div class="outline-text-3" id="text-2-2">
<p>
GTD全名Getting things done, 它只是一种思想, 所能管理的是大厦的1楼.
它的核心目的: 事物存储在脑外, 大脑用来思考.
</p>

<p>
GTD的工作流程(算法)甚至文件(结构)都是可以自定义的. 适合的才是最好的.
</p>

<p>
吐槽: 中文译本《Getting things done》满篇废话.
</p>
</div>
</div>
</div>
<div id="outline-container-org9797d90" class="outline-2">
<h2 id="org9797d90"><span class="section-number-2">3</span> GTD怎么实现</h2>
<div class="outline-text-2" id="text-3">
<p>
GTD的实现方式非常之多, 有很多软件工具. 最喜欢的还是org-mode(emacs 插件).
</p>
</div>
</div>
<div id="outline-container-orgfcd2db5" class="outline-2">
<h2 id="orgfcd2db5"><span class="section-number-2">4</span> org mode怎么实现GTD</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org33138a8" class="outline-3">
<h3 id="org33138a8"><span class="section-number-3">4.1</span> 思路的设计</h3>
<div class="outline-text-3" id="text-4-1">
<p>
5楼 到 地面视角
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">楼数</th>
<th scope="col" class="org-left">功能</th>
<th scope="col" class="org-left">说明</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">5楼</td>
<td class="org-left">人生规划</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4楼</td>
<td class="org-left">3年目标</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3楼</td>
<td class="org-left">1年目标</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2楼</td>
<td class="org-left">职责范围</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">1楼</td>
<td class="org-left">项目</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">GTD管理</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">地面</td>
<td class="org-left">行动清单</td>
<td class="org-left">隶属1楼</td>
<td class="org-left">GTD管理</td>
</tr>
</tbody>
</table>
<p>
备注 : GTD管理的其实是 1楼 &amp;&amp; 地面的清单
</p>
</div>
</div>

<div id="outline-container-org511e486" class="outline-3">
<h3 id="org511e486"><span class="section-number-3">4.2</span> 流程的设计</h3>
<div class="outline-text-3" id="text-4-2">
<pre class="example">
--------------------------------+-------------------------------
			        |
		                |
	                        +-----------------------\ capture
                                |			    \
                                |
                                |
 			   +----------+
			   |  inbox   |
 			   +----------+
	       	       	     /      \
			    /        \  -----------------\ refile
			   /	         \     	       	     \
			  /	          \
			 /  	     	   \
		    +---------+     	+-----------+
		    |  task   | ---&gt;	|  trash    |
		    +---------+     	+-----------+
		       |
		       |
		       |
		       | ---------------------------------\ archive
		       |  				      \
		       |
		       |
       	       	 +---------+
       	       	 | archive |
		 +---------+
</pre>
</div>
</div>
<div id="outline-container-org1265f98" class="outline-3">
<h3 id="org1265f98"><span class="section-number-3">4.3</span> 文件的设计</h3>
<div class="outline-text-3" id="text-4-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">文件名</th>
<th scope="col" class="org-left">说明</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">inbox.org</td>
<td class="org-left">收集箱</td>
<td class="org-left">1. 不区分时间, 不区分场景</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2. 灵光一闪即可扔进去保存</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3. 自动清空</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">task.org</td>
<td class="org-left">任务清单</td>
<td class="org-left">1. priority标签</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">task</td>
<td class="org-left">2. 四象限约束</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">项目清单</td>
<td class="org-left">1. 凡是steps&gt;1的都属于项目</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">project</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">archive.org</td>
<td class="org-left">参考资料</td>
<td class="org-left">1. 有参考价值的东西</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2. 垃圾箱</td>
</tr>
</tbody>
</table>
<p>
备注:
</p>
<ol class="org-ol">
<li>task 与 project的唯一区别
task只有one step,  project的steps &gt; 1</li>
<li>文件都是通过流程来操作的, 不应该手动去干预</li>
</ol>
</div>
</div>

<div id="outline-container-org49653e8" class="outline-3">
<h3 id="org49653e8"><span class="section-number-3">4.4</span> <span class="todo TODO">TODO</span> 的设计</h3>
<div class="outline-text-3" id="text-4-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-left">功能</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">TODO</td>
<td class="org-left">等待自己处理</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">WAITTING</td>
<td class="org-left">等待他人完成</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DONE</td>
<td class="org-left">完成</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">CANCEL</td>
<td class="org-left">取消</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
备注:
</p>
<ol class="org-ol">
<li>针对的对象是下一步行动清单</li>
<li>project中的下一步行动即是最上层的行动;
task中的下一步行动是依据四象限法则来确定的.</li>
<li>TODO与WAITTING的含义, 表示该行动正在或即将处理</li>
</ol>
</div>
</div>

<div id="outline-container-org2a7193d" class="outline-3">
<h3 id="org2a7193d"><span class="section-number-3">4.5</span> TAGS的设计</h3>
<div class="outline-text-3" id="text-4-5">
<p>
四象限使用proirity来区分;
TAGS为之后快速查找使用
</p>
</div>
</div>

<div id="outline-container-orga8f6745" class="outline-3">
<h3 id="orga8f6745"><span class="section-number-3">4.6</span> Agent的设计</h3>
<div class="outline-text-3" id="text-4-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">命令</th>
<th scope="col" class="org-left">含义</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-c a a</td>
<td class="org-left">查看当下的操作</td>
<td class="org-left">最好把当下设置为1月, 能全局一览</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">C-c a n</td>
<td class="org-left">当下没有操作, 则可以查看next step</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">C-c a i</td>
<td class="org-left">查看inbox中的记录</td>
<td class="org-left">无需在查看inbox; inbox中的TODO会自动</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">refile到task中</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">如果inbox中也没有</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">则应该反思, 最近是不是太闲了</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7fdf80c" class="outline-3">
<h3 id="org7fdf80c"><span class="section-number-3">4.7</span> 使用流程</h3>
<div class="outline-text-3" id="text-4-7">
<pre class="example">
     随时            	       自动处理        	       	  C-c a n界面		      C-c a a 界面
      |			  |  			      |				 |
      |			  |			      |				 |
|    	v      	       	       	  v			      v				 v
| 1.capture		     1. auto refile		 1.add timestamp       	  1. auto archive
|   with TODO  +---------+   		 +------------+	       	     +----------+	     +-----------+
+------------&gt; | inbox   |-----------&gt; | next step  |-------------&gt;| agenda   |-----------&gt;| archive   |
|   C-c c    	 +---------+   	       	 +------------+	 m-&gt;a-&gt;s,d   +----------+            +-----------+
|
|

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-09-20 Mon 20:12</p>
<p class="validation"></p>
</div>
</body>
</html>
